tutorials/ML/19simpleTurbGeomClosed/constant/polyMesh/blockMeshDict
// generated using Lx1=2, Lx2=5, Ly1=.66666666666666666666, Ly2=1, Lz=0.1, Nx1=20, Nx2=50, Ny1=20, Ny2=20 
 
 
// generated using H0/H=1 


FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (0 0 0)
    (2 0 0)
    (2 -.66666666666666666666 0)
    (7 -.66666666666666666666 0)
    (7 0 0)
    (9 -.36666666666666666666 0)
    (9 0 0)
    (9 0.7 0)
    (7 1 0)
    (2 1 0)
    (0 1 0)
    (0 0 0.1)
    (2 0 0.1)
    (2 -.66666666666666666666 0.1)
    (7 -.66666666666666666666 0.1)
    (7 0 0.1)
    (9 -.36666666666666666666 0.1)
    (9 0 0.1)
    (9 0.7 0.1)
    (7 1 0.1)
    (2 1 0.1)
    (0 1 0.1)
);
blocks
(
    hex (0 1 9 10 11 12 20 21) (50 40 1) simpleGrading (1 1 1)
    hex (1 4 8 9 12 15 19 20) (100 40 1) simpleGrading (1 1 1)
    hex (2 3 4 1 13 14 15 12) (100 40 1) simpleGrading (1 1 1)
    hex (3 5 6 4  14 16 17 15) (50 40 1) simpleGrading (1 1 1)
    hex (4 6 7 8  15 17 18 19) (50 40 1) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 21 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 16 17 6)
            (6 17 18 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 9 10)
            (11 12 20 21)
            (1 4 8 9)
	        (12 15 19 20)
            (3 5 6 4)
            (14 16 17 15)
            (4 6 7 8)
            (15 17 18 19)
        );
    }
    frontAndBackLow
    {
        type empty;
        faces
        (
            (2 3 4 1)
            (13 14 15 12)
        );
    }
    walls
    {
        type wall;
        faces
        (
	(0 1 12 11)
	(10 9 20 21)
	(9 8 19 20)
    (8 7 18 19)
    (3 5 16 14)
        );
     }
    step
    {
        type wall;
        faces
        (
    (2 13 12 1)
    (2 3 14 13)
        );
     }
);
mergePatchPairs
(
);
