tutorials/ML/19simpleTurbGeomClosed/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackLow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }
    step
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }
}


// ************************************************************************* //
