tutorials/ML/19simpleTurbGeomClosed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default         cellMDLimited leastSquares 1.0; 
}

divSchemes
{
    default         none;
    div(phi,U) Gauss linearUpwind grad(U);
    div(phi,k) Gauss linear Upwind;
    div(phi,epsilon)  Gauss linear Upwind;
    div(phi,omega)  Gauss linearUpwind;
    div(phi,v2)     bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(div(phi,U)) Gauss linear;
    div(nonlinearStress) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
    interpolate(y) linear;
}

snGradSchemes
{
    default limited 0.333;
}

fluxRequired
{
    default         no;
    pcorr           ;
    p;
    Phi             ;

}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
